Revit 2026 API

# ViewSheetSetOrderedViewList Property

---

Ordered views.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IReadOnlyList<View> OrderedViewList { get; set; }
```
```vb
Public Overridable Property OrderedViewList As IReadOnlyList(Of View)
	Get
	Set
```
```cpp
public:
virtual property IReadOnlyList<View^>^ OrderedViewList {
	IReadOnlyList<View^>^ get ();
	void set (IReadOnlyList<View^>^ value);
}
```
```fsharp
abstract OrderedViewList : IReadOnlyList<View> with get, set
override OrderedViewList : IReadOnlyList<View> with get, set
```

#### Property Value

IReadOnlyListView

#### Implements

IViewSheetSetOrderedViewList

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input ordered view list is . |
| InvalidOperationException | Thrown when the set operation failed due to invalid view which cannot be printed. |

#### Reference

ViewSheetSet Class

Autodesk.Revit.DB Namespace